# Отделяне на цифрите от естествени числа и намиране на сбора им

# Въвеждане на естествено число от клавиатурата
number = int(input("Въведете естествено число:"))
while number < 0:
    number = int(input("Въведете естествено число:"))

# преобразуване на числото в низ и намиране на неговата дължина
digit_count = len(str(number))
sum = 0
n = number
# намиране на цифрите и сбора им
for i in range(0, digit_count):
    digit = n % 10
    n = n // 10
    sum = sum + digit

# Извеждане на числото и сбора на цифрите му
print("Сборът от цифрите на", number, "е", sum)

