# Пресмятане на обиколка и лице на правилен многоъгълник;
# изчертаване на правилен многоъгълник; запълване на правилен многоъгълник с цвят

import turtle
pen = turtle.Turtle()

# задаване на брой на страни
n = int(input("Въведете броя на страните:"))
while n <= 2:
    n = int(input("Въведете броя на страните:"))

# задаване на страна на правилен многоъгълник
b = float(input("Въведете дължината на страна в cm (между 1 и 10):"))
while b <= 0:
    b = float(input("Въведете дължината на страна в cm (между 1 и 10):"))

# задаване на апотема на правилен многоъгълник
a = float(input("Въведете дължината на апотемата в cm (между 1 и 10):"))
while a <= 0:
    a = float(input("Въведете дължината на апотемата в cm (между 1 и 10):"))

# функция за пресмятане на обиколката правилен многоъгълник
def P (n, b):
    P =  n * b
    return P
# функция за пресмятане на лицето на правилен многоъгълник
def B (n, b, a):
    B =  1/2 * n * b * a
    return B

print("Обиколката на правилния многоъгълник е:", P (n, b))
print("Лицето на на правилния многоъгълник е:", B (n, b, a))

# функция за изчертаване на правилен многоъгълник
def poligon (n, b):
    pen.pendown()
    for side in range(n):
        pen.forward(b)
        pen.left(360/n)
# изчертаване на правилен многоъгълник и запълване с цвят
pen.fillcolor("pink")
pen.begin_fill()
poligon(n , b*20)
pen.end_fill()
